OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f86j99.h
extern __at(0x0E36) __sfr RPINR24_25;

typedef union
  {
  struct
    {
    unsigned IOC6R0             : 1;
    unsigned IOC6R1             : 1;
    unsigned IOC6R2             : 1;
    unsigned IOC6R3             : 1;
    unsigned IOC7R0             : 1;
    unsigned IOC7R1             : 1;
    unsigned IOC7R2             : 1;
    unsigned IOC7R3             : 1;
    };

  struct
    {
    unsigned IOC6R              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned IOC7R              : 4;
    };
  } __RPINR24_25bits_t;

extern __at(0x0E36) volatile __RPINR24_25bits_t RPINR24_25bits;

#define _IOC6R0                 0x01
#define _IOC6R1                 0x02
#define _IOC6R2                 0x04
#define _IOC6R3                 0x08
#define _IOC7R0                 0x10
#define _IOC7R1                 0x20
#define _IOC7R2                 0x40
#define _IOC7R3                 0x80

//==============================================================================


//==============================================================================
//        RPINR26_27 Bits

extern __at(0x0E37) __sfr RPINR26_27;

typedef union
  {
  struct
    {
    unsigned INT1R0             : 1;
    unsigned INT1R1             : 1;
    unsigned INT1R2             : 1;
    unsigned INT1R3             : 1;
    unsigned INT2R0             : 1;
    unsigned INT2R1             : 1;
    unsigned INT2R2             : 1;
    unsigned INT2R3             : 1;
    };

  struct
    {
    unsigned INT1R              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned INT2R              : 4;
    };
  } __RPINR26_27bits_t;

extern __at(0x0E37) volatile __RPINR26_27bits_t RPINR26_27bits;

#define _INT1R0                 0x01
#define _INT1R1                 0x02
#define _INT1R2                 0x04
#define _INT1R3                 0x08
#define _INT2R0                 0x10
#define _INT2R1                 0x20
#define _INT2R2                 0x40
#define _INT2R3                 0x80

//==============================================================================


//==============================================================================
//        RPINR28_29 Bits

extern __at(0x0E38) __sfr RPINR28_29;

typedef union
  {
  struct
    {
    unsigned INT3R0             : 1;
    unsigned INT3R1             : 1;
    unsigned INT3R2             : 1;
    unsigned INT3R3             : 1;
    unsigned MDMINR0            : 1;
    unsigned MDMINR1            : 1;
    unsigned MDMINR2            : 1;
    unsigned MDMINR3            : 1;
    };

  struct
    {
    unsigned INT3R              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned MDMINR             : 4;
    };
  } __RPINR28_29bits_t;

extern __at(0x0E38) volatile __RPINR28_29bits_t RPINR28_29bits;

#define _INT3R0                 0x01
#define _INT3R1                 0x02
#define _INT3R2                 0x04
#define _INT3R3                 0x08
#define _MDMINR0                0x10
#define _MDMINR1                0x20
#define _MDMINR2                0x40
#define _MDMINR3                0x80

//==============================================================================


//==============================================================================
//        RPINR30_31 Bits

extern __at(0x0E39) __sfr RPINR30_31;

typedef union
  {
  struct
    {
    unsigned MDCIN1R0           : 1;
    unsigned MDCIN1R1           : 1;
    unsigned MDCIN1R2           : 1;
    unsigned MDCIN1R3           : 1;
    unsigned MDCIN2R0           : 1;
    unsigned MDCIN2R1           : 1;
    unsigned MDCIN2R2           : 1;
    unsigned MDCIN2R3           : 1;
    };

  struct
    {
    unsigned MDCIN1R            : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned MDCIN2R            : 4;
    };
  } __RPINR30_31bits_t;

extern __at(0x0E39) volatile __RPINR30_31bits_t RPINR30_31bits;

#define _MDCIN1R0               0x01
#define _MDCIN1R1               0x02
#define _MDCIN1R2               0x04
#define _MDCIN1R3               0x08
#define _MDCIN2R0               0x10
#define _MDCIN2R1               0x20
#define _MDCIN2R2               0x40
#define _MDCIN2R3               0x80

//==============================================================================


//==============================================================================
//        RPINR32_33 Bits

extern __at(0x0E3A) __sfr RPINR32_33;

typedef union
  {
  struct
    {
    unsigned CCP4R0             : 1;
    unsigned CCP4R1             : 1;
    unsigned CCP4R2             : 1;
    unsigned CCP4R3             : 1;
    unsigned CCP5R0             : 1;
    unsigned CCP5R1             : 1;
    unsigned CCP5R2             : 1;
    unsigned CCP5R3             : 1;
    };

  struct
    {
    unsigned CCP4R              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned CCP5R              : 4;
    };
  } __RPINR32_33bits_t;

extern __at(0x0E3A) volatile __RPINR32_33bits_t RPINR32_33bits;

#define _CCP4R0                 0x01
#define _CCP4R1                 0x02
#define _CCP4R2                 0x04
#define _CCP4R3                 0x08
#define _CCP5R0                 0x10
#define _CCP5R1                 0x20
#define _CCP5R2                 0x40
#define _CCP5R3                 0x80

//==============================================================================


//==============================================================================
//        RPINR34_35 Bits

extern __at(0x0E3B) __sfr RPINR34_35;

typedef union
  {
  struct
    {
    unsigned CCP6R0             : 1;
    unsigned CCP6R1             : 1;
    unsigned CCP6R2             : 1;
    unsigned CCP6R3             : 1;
    unsigned CCP7R0             : 1;
    unsigned CCP7R1             : 1;
    unsigned CCP7R2             : 1;
    unsigned CCP7R3             : 1;
    };

  struct
    {
    unsigned CCP6R              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned CCP7R              : 4;
    };
  } __RPINR34_35bits_t;

