OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f86j99.h
extern __at(0x0E81) __sfr ADCHIT1H;

typedef struct
  {
  unsigned CHH24                : 1;
  unsigned CHH25                : 1;
  unsigned CHH26                : 1;
  unsigned CHH27                : 1;
  unsigned CHH28                : 1;
  unsigned CHH29                : 1;
  unsigned CHH30                : 1;
  unsigned                      : 1;
  } __ADCHIT1Hbits_t;

extern __at(0x0E81) volatile __ADCHIT1Hbits_t ADCHIT1Hbits;

#define _CHH24                  0x01
#define _CHH25                  0x02
#define _CHH26                  0x04
#define _CHH27                  0x08
#define _CHH28                  0x10
#define _CHH29                  0x20
#define _CHH30                  0x40

//==============================================================================


//==============================================================================
//        ADCSS0L Bits

extern __at(0x0E82) __sfr ADCSS0L;

typedef struct
  {
  unsigned CSS0                 : 1;
  unsigned CSS1                 : 1;
  unsigned CSS2                 : 1;
  unsigned CSS3                 : 1;
  unsigned CSS4                 : 1;
  unsigned CSS5                 : 1;
  unsigned CSS6                 : 1;
  unsigned CSS7                 : 1;
  } __ADCSS0Lbits_t;

extern __at(0x0E82) volatile __ADCSS0Lbits_t ADCSS0Lbits;

#define _CSS0                   0x01
#define _CSS1                   0x02
#define _CSS2                   0x04
#define _CSS3                   0x08
#define _CSS4                   0x10
#define _CSS5                   0x20
#define _CSS6                   0x40
#define _CSS7                   0x80

//==============================================================================


//==============================================================================
//        ADCSS0H Bits

extern __at(0x0E83) __sfr ADCSS0H;

typedef struct
  {
  unsigned CSS8                 : 1;
  unsigned CSS9                 : 1;
  unsigned CSS10                : 1;
  unsigned CSS11                : 1;
  unsigned CSS12                : 1;
  unsigned CSS13                : 1;
  unsigned CSS14                : 1;
  unsigned CSS15                : 1;
  } __ADCSS0Hbits_t;

extern __at(0x0E83) volatile __ADCSS0Hbits_t ADCSS0Hbits;

#define _CSS8                   0x01
#define _CSS9                   0x02
#define _CSS10                  0x04
#define _CSS11                  0x08
#define _CSS12                  0x10
#define _CSS13                  0x20
#define _CSS14                  0x40
#define _CSS15                  0x80

//==============================================================================


//==============================================================================
//        ADCSS1L Bits

extern __at(0x0E84) __sfr ADCSS1L;

typedef struct
  {
  unsigned CSS16                : 1;
  unsigned CSS17                : 1;
  unsigned CSS18                : 1;
  unsigned CSS19                : 1;
  unsigned CSS20                : 1;
  unsigned CSS21                : 1;
  unsigned CSS22                : 1;
  unsigned CSS23                : 1;
  } __ADCSS1Lbits_t;

extern __at(0x0E84) volatile __ADCSS1Lbits_t ADCSS1Lbits;

#define _CSS16                  0x01
#define _CSS17                  0x02
#define _CSS18                  0x04
#define _CSS19                  0x08
#define _CSS20                  0x10
#define _CSS21                  0x20
#define _CSS22                  0x40
#define _CSS23                  0x80

//==============================================================================


//==============================================================================
//        ADCSS1H Bits

extern __at(0x0E85) __sfr ADCSS1H;

typedef struct
  {
  unsigned CSS24                : 1;
  unsigned CSS25                : 1;
  unsigned CSS26                : 1;
  unsigned CSS27                : 1;
  unsigned CSS28                : 1;
  unsigned CSS29                : 1;
  unsigned CSS30                : 1;
  unsigned                      : 1;
  } __ADCSS1Hbits_t;

extern __at(0x0E85) volatile __ADCSS1Hbits_t ADCSS1Hbits;

#define _CSS24                  0x01
#define _CSS25                  0x02
#define _CSS26                  0x04
#define _CSS27                  0x08
#define _CSS28                  0x10
#define _CSS29                  0x20
#define _CSS30                  0x40

//==============================================================================


//==============================================================================
//        ADCHS0L Bits

extern __at(0x0E86) __sfr ADCHS0L;

typedef union
  {
  struct
    {
    unsigned CH0SA0             : 1;
    unsigned CH0SA1             : 1;
    unsigned CH0SA2             : 1;
    unsigned CH0SA3             : 1;
    unsigned CH0SA4             : 1;
    unsigned CH0NA0             : 1;
    unsigned CH0NA1             : 1;
    unsigned CH0NA2             : 1;
    };

  struct
    {
    unsigned CH0SA              : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned                    : 5;
    unsigned CH0NA              : 3;
    };
  } __ADCHS0Lbits_t;

extern __at(0x0E86) volatile __ADCHS0Lbits_t ADCHS0Lbits;

#define _CH0SA0                 0x01
#define _CH0SA1                 0x02
#define _CH0SA2                 0x04
#define _CH0SA3                 0x08
#define _CH0SA4                 0x10
#define _CH0NA0                 0x20
#define _CH0NA1                 0x40
#define _CH0NA2                 0x80

//==============================================================================


//==============================================================================
//        ADCHS0H Bits

extern __at(0x0E87) __sfr ADCHS0H;

typedef union
  {
  struct
    {
    unsigned CH0SB0             : 1;
    unsigned CH0SB1             : 1;
    unsigned CH0SB2             : 1;
    unsigned CH0SB3             : 1;
    unsigned CH0SB4             : 1;
    unsigned CH0NB0             : 1;
    unsigned CH0NB1             : 1;
    unsigned CH0NB2             : 1;
    };

  struct
    {
    unsigned CH0SB              : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned                    : 5;
    unsigned CH0NB              : 3;
    };
  } __ADCHS0Hbits_t;

