OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f86j99.h
extern __at(0x0F20) volatile __SPBRGH2bits_t SPBRGH2bits;

#define _SPBRGH2_BRG8           0x01
#define _SPBRGH2_BRG9           0x02
#define _SPBRGH2_BRG10          0x04
#define _SPBRGH2_BRG11          0x08
#define _SPBRGH2_BRG12          0x10
#define _SPBRGH2_BRG13          0x20
#define _SPBRGH2_BRG14          0x40
#define _SPBRGH2_BRG15          0x80

//==============================================================================

extern __at(0x0F21) __sfr DSGPR3;
extern __at(0x0F22) __sfr DSGPR2;
extern __at(0x0F23) __sfr DSGPR1;
extern __at(0x0F24) __sfr DSGPR0;

//==============================================================================
//        DSWAKEH Bits

extern __at(0x0F25) __sfr DSWAKEH;

typedef struct
  {
  unsigned DSINT0               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __DSWAKEHbits_t;

extern __at(0x0F25) volatile __DSWAKEHbits_t DSWAKEHbits;

#define _DSINT0                 0x01

//==============================================================================


//==============================================================================
//        DSWAKEL Bits

extern __at(0x0F26) __sfr DSWAKEL;

typedef struct
  {
  unsigned DSPOR                : 1;
  unsigned DSICD                : 1;
  unsigned DSMCLR               : 1;
  unsigned DSRTC                : 1;
  unsigned DSWDT                : 1;
  unsigned DSULP                : 1;
  unsigned BOR                  : 1;
  unsigned DSFLT                : 1;
  } __DSWAKELbits_t;

extern __at(0x0F26) volatile __DSWAKELbits_t DSWAKELbits;

#define _DSPOR                  0x01
#define _DSICD                  0x02
#define _DSMCLR                 0x04
#define _DSRTC                  0x08
#define _DSWDT                  0x10
#define _DSULP                  0x20
#define _BOR                    0x40
#define _DSFLT                  0x80

//==============================================================================


//==============================================================================
//        DSCONH Bits

extern __at(0x0F27) __sfr DSCONH;

typedef struct
  {
  unsigned RTCWDIS              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned DSEN                 : 1;
  } __DSCONHbits_t;

extern __at(0x0F27) volatile __DSCONHbits_t DSCONHbits;

#define _RTCWDIS                0x01
#define _DSEN                   0x80

//==============================================================================


//==============================================================================
//        DSCONL Bits

extern __at(0x0F28) __sfr DSCONL;

typedef struct
  {
  unsigned RELEASE              : 1;
  unsigned DSBOR                : 1;
  unsigned ULPWDIS              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __DSCONLbits_t;

extern __at(0x0F28) volatile __DSCONLbits_t DSCONLbits;

#define _RELEASE                0x01
#define _DSBOR                  0x02
#define _ULPWDIS                0x04

//==============================================================================

extern __at(0x0F29) __sfr TXREG3;
extern __at(0x0F2A) __sfr RCREG3;

//==============================================================================
//        SPBRG3 Bits

extern __at(0x0F2B) __sfr SPBRG3;

typedef struct
  {
  unsigned BRG0                 : 1;
  unsigned BRG1                 : 1;
  unsigned BRG2                 : 1;
  unsigned BRG3                 : 1;
  unsigned BRG4                 : 1;
  unsigned BRG5                 : 1;
  unsigned BRG6                 : 1;
  unsigned BRG7                 : 1;
  } __SPBRG3bits_t;

extern __at(0x0F2B) volatile __SPBRG3bits_t SPBRG3bits;

#define _SPBRG3_BRG0            0x01
#define _SPBRG3_BRG1            0x02
#define _SPBRG3_BRG2            0x04
#define _SPBRG3_BRG3            0x08
#define _SPBRG3_BRG4            0x10
#define _SPBRG3_BRG5            0x20
#define _SPBRG3_BRG6            0x40
#define _SPBRG3_BRG7            0x80

//==============================================================================


//==============================================================================
//        SPBRGH3 Bits

extern __at(0x0F2C) __sfr SPBRGH3;

typedef struct
  {
  unsigned BRG8                 : 1;
  unsigned BRG9                 : 1;
  unsigned BRG10                : 1;
  unsigned BRG11                : 1;
  unsigned BRG12                : 1;
  unsigned BRG13                : 1;
  unsigned BRG14                : 1;
  unsigned BRG15                : 1;
  } __SPBRGH3bits_t;

extern __at(0x0F2C) volatile __SPBRGH3bits_t SPBRGH3bits;

#define _SPBRGH3_BRG8           0x01
#define _SPBRGH3_BRG9           0x02
#define _SPBRGH3_BRG10          0x04
#define _SPBRGH3_BRG11          0x08
#define _SPBRGH3_BRG12          0x10
#define _SPBRGH3_BRG13          0x20
#define _SPBRGH3_BRG14          0x40
#define _SPBRGH3_BRG15          0x80

//==============================================================================


//==============================================================================
//        BAUDCON3 Bits

extern __at(0x0F2D) __sfr BAUDCON3;

typedef struct
  {
  unsigned ABDEN                : 1;
  unsigned WUE                  : 1;
  unsigned IREN                 : 1;
  unsigned BRG16                : 1;
  unsigned TXCKP                : 1;
  unsigned RXDTP                : 1;
  unsigned RCIDL                : 1;
  unsigned ABDOVF               : 1;
  } __BAUDCON3bits_t;

extern __at(0x0F2D) volatile __BAUDCON3bits_t BAUDCON3bits;

#define _BAUDCON3_ABDEN         0x01
#define _BAUDCON3_WUE           0x02
#define _BAUDCON3_IREN          0x04
#define _BAUDCON3_BRG16         0x08
#define _BAUDCON3_TXCKP         0x10
#define _BAUDCON3_RXDTP         0x20
#define _BAUDCON3_RCIDL         0x40
#define _BAUDCON3_ABDOVF        0x80

//==============================================================================


//==============================================================================
//        TXSTA3 Bits

extern __at(0x0F2E) __sfr TXSTA3;

typedef struct
  {
  unsigned TX9D                 : 1;
  unsigned TRMT                 : 1;
  unsigned BRGH                 : 1;
  unsigned SENDB                : 1;
  unsigned SYNC                 : 1;
  unsigned TXEN                 : 1;
  unsigned TX9                  : 1;
  unsigned CSRC                 : 1;
  } __TXSTA3bits_t;

extern __at(0x0F2E) volatile __TXSTA3bits_t TXSTA3bits;

#define _TXSTA3_TX9D            0x01
#define _TXSTA3_TRMT            0x02
#define _TXSTA3_BRGH            0x04
#define _TXSTA3_SENDB           0x08
#define _TXSTA3_SYNC            0x10
#define _TXSTA3_TXEN            0x20
#define _TXSTA3_TX9             0x40
#define _TXSTA3_CSRC            0x80

//==============================================================================


//==============================================================================
//        RCSTA3 Bits

extern __at(0x0F2F) __sfr RCSTA3;

typedef struct
  {
  unsigned RX9D                 : 1;
  unsigned OERR                 : 1;
  unsigned FERR                 : 1;
  unsigned ADDEN                : 1;
  unsigned CREN                 : 1;
  unsigned SREN                 : 1;
  unsigned RX9                  : 1;
  unsigned SPEN                 : 1;
  } __RCSTA3bits_t;

extern __at(0x0F2F) volatile __RCSTA3bits_t RCSTA3bits;

#define _RCSTA3_RX9D            0x01
#define _RCSTA3_OERR            0x02
#define _RCSTA3_FERR            0x04
#define _RCSTA3_ADDEN           0x08
#define _RCSTA3_CREN            0x10
#define _RCSTA3_SREN            0x20
#define _RCSTA3_RX9             0x40
#define _RCSTA3_SPEN            0x80

//==============================================================================


//==============================================================================
//        SPBRGH Bits

